# Aula 3 - Pandas

Nessa aula, iremos tratar dos seguintes conteúdos:
- Numpy Matrizes
- Métodos de Matrizes Numpy
- Pandas
- Series
- Métodos Pandas
- DataFrames
- Trabalhando com CSVs

<img src="" width=800>

Utilize comprehension para gerar a lista de todos os números pares entre 0 e 19. Converta a lista em um __numpy__ array e cálcule a média.

In [5]:
import numpy as np

numbers = [i for i in range(0, 20)]
numbers_arr = np.array(numbers)
numbers_avg = np.mean(numbers_arr)
print('Os números são', numbers_arr)
print('A média é', numbers_avg)

Os números são [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19]
A média é 9.5

## Matrizes - Arrays Bidimensionais

In [6]:
## Cria uma matriz usando o np.array
lista_1 = [0, 1, 2, 3]
linha_2 = [4, 5, 6, 7]
matriz = np.array([lista_1, linha_2])
print(matriz)

[[0 1 2 3]
 [4 5 6 7]]

In [4]:
## É possível fazer matrizes com as funções que já trabalhamos anteriormente

## zeros
matriz_zeros = np.zeros((5, 3))
print("Matriz de zeros")
print(matriz_zeros)

print('\n')

## uns
matriz_uns = np.ones((5, 10))
print("Matriz de uns")
print(matriz_uns)

print('\n')
## identidade
matriz_ident = np.identity((10))
print("Matriz de ident")
print(matriz_ident)

print('\n')

## linspace

Matriz de zeros
[[0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]]


Matriz de uns
[[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]]


Matriz de ident
[[1. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 1. 0. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 1. 0. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 1. 0. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 1. 0. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 1. 0. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 1. 0. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 0. 0. 0. 0. 0. 1.]]

Numpy arrays são objetos chamados _ndarrays_ e possuem diversos atributos 
- ndarray.ndim - número de eixos (dimensões) do array
- ndarray.shape - uma tupla de inteiros indicando o tamanho do array em cada dimensão
- ndarray.size - o número total de elementos do array
- ndarray.dtype - tipo dos elementos no array
- ndarray.itemsize - o tamanho em bytes de cada elemento do array
- ndarray.data - o buffer de memória contendo os elementos do array

In [5]:
## Verifica o tipo
array = np.linspace(0, 2, 30)
print(type(array))

<class 'numpy.ndarray'>

In [6]:
## Vamos ver os atributos
print('Array')
print(array)

print('\n')

print('ndim =', array.ndim)
print('shape =', array.shape)
print('size =', array.size)
print('dtype =', array.dtype)
print('itemsize =', array.itemsize)
print('data =', array.data)

print('\n')

matriz_identidade = np.identity(5)
print('Matriz identidade')
print(matriz_identidade)

print('\n')

print('ndim =',matriz_identidade.ndim)
print('shape =', matriz_identidade.shape)
print('size =', matriz_identidade.size)
print('dtype =', matriz_identidade.dtype)
print('itemsize =', matriz_identidade.itemsize)
print('data =', matriz_identidade.data)

Array
[0.         0.06896552 0.13793103 0.20689655 0.27586207 0.34482759
 0.4137931  0.48275862 0.55172414 0.62068966 0.68965517 0.75862069
 0.82758621 0.89655172 0.96551724 1.03448276 1.10344828 1.17241379
 1.24137931 1.31034483 1.37931034 1.44827586 1.51724138 1.5862069
 1.65517241 1.72413793 1.79310345 1.86206897 1.93103448 2.        ]


ndim = 1
shape = (30,)
size = 30
dtype = float64
itemsize = 8
data = <memory at 0x7fa12c176648>


Matriz identidade
[[1. 0. 0. 0. 0.]
 [0. 1. 0. 0. 0.]
 [0. 0. 1. 0. 0.]
 [0. 0. 0. 1. 0.]
 [0. 0. 0. 0. 1.]]


ndim = 2
shape = (5, 5)
size = 25
dtype = float64
itemsize = 8
data = <memory at 0x7fa12c0441f8>

## Métodos Numpy para matrizes

Vamos aprender agora alguns métodos muito úteis para serem aplicados em arrays, muitos desses métodos serão herdados pelo Pandas, então vão ter uma usabilidade bem grande:

__Método reshape:__  permite reformatar o array modificando o número de linhas e colunas, porém, a nova 'shape' tem que possuir o mesmo número de elementos do array original:

In [7]:
## reshape
arr1 = np.arange(9)

print(arr1)
print('\n')

arr_reshape = arr1.reshape((3, 3))

print(arr_reshape)
print('\n')

[0 1 2 3 4 5 6 7 8]


[[0 1 2]
 [3 4 5]
 [6 7 8]]

__Método ravel:__  concatena as linhas da matriz em um array unidimensional:

In [8]:
## ravel
print(arr_reshape)
arr_ravel = arr_reshape.ravel()
print(arr_ravel)

[[0 1 2]
 [3 4 5]
 [6 7 8]]
[0 1 2 3 4 5 6 7 8]

__Método flatten__: também concatena as linhas da matriz em um array unidimensional, porém, faz uma cópia dos elementos. O método ravel gera uma view, portanto se algum elemento for modificado, o array original também é modificado:

In [9]:
## Flatten
arr_flatten = arr_reshape.flatten()
arr_flatten[4]= 50

print(arr_flatten)
print(arr_reshape)

[ 0  1  2  3 50  5  6  7  8]
[[0 1 2]
 [3 4 5]
 [6 7 8]]

__Transposta de Matriz:__ Ao calcular a tranposta da Matriz, inverte os valores das linhas pelas colunas de cada uma das posições:

In [10]:
## Transposta
matriz = np.ones((5, 3))

matriz_t = matriz.T

print(matriz)
print(matriz_t)

[[1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]]
[[1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]
 [1. 1. 1. 1. 1.]]

__Máscaras booleanas__ seguem valendo para matrizes:

In [11]:
## Máscara
array = np.arange(18).reshape(3,6)
print("Matriz: ")
print(array)

Matriz:
[[ 0  1  2  3  4  5]
 [ 6  7  8  9 10 11]
 [12 13 14 15 16 17]]

## Exercício

1 - Faça um programa que peça para o usuário digitar o nome de um produto e seu preço, armazene esses dados em um array multidimensional. Em seguida, exiba esses dados na tela, de forma que a leitura fique facilitada.

In [12]:
lista_1 =[]
lista_2 = []

for item in range(5):
    lista_1.append(str(input('Digite o nome do produto ' + str(item+1) + ':')))
    lista_2.append(float(input('Digite o valor do produto ' + str(item+1) + ':')))
matriz_1 = np.array([lista_1, lista_2])

print('/n')

matriz_res = matriz_1.T
print(matriz_res)

Digite o nome do produto 1:a
Digite o valor do produto 1:a

ValueError: could not convert string to float: 'a'

In [ ]:
a

In [ ]:
matriz_2 = matriz_1.T
print(matriz_2)

2 - Usando o array criado no anterior, peça para o usuário digitar um indice de produto e retorne a linha correspondente do array com produtos e preços

In [ ]:
Mascara = int(input('Digite o indice da matriz :'))
print(matriz_2[Mascara])

## Pandas

__Pandas__ é um pacote python construído com base no __NumPy__ e __Matplotlib__ que busca organizar dados no formato de tabela, atribuindo rótulos às linhas e colunas. O pacote __Pandas__ fornece ainda um conjunto de funcionalidades que permite processar as informações de tabelas de forma bastante eficiente, implementando métodos fundamentais para fins de tratamento de dados.

O Pandas organiza os dados nos seguintes tipos de estruturas:
- Series (Séries)
- DataFrame

 O __Pandas__ é um pacote e para utilizarmos, devemos importá-lo para o nosso notebook da seguinte forma:

In [8]:
# import da bibloteca do Pandas
import pandas as pd

In [2]:
!pip install pandas

Collecting pandas
  Downloading pandas-1.4.2-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (11.7 MB)
     |████████████████████████████████| 11.7 MB 889 kB/s eta 0:00:01
Collecting pytz>=2020.1
  Using cached pytz-2022.1-py2.py3-none-any.whl (503 kB)
Collecting numpy>=1.18.5; platform_machine != "aarch64" and platform_machine != "arm64" and python_version < "3.10"
  Downloading numpy-1.22.4-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (16.9 MB)
     |████████████████████████████████| 16.9 MB 3.7 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.8.1 in /home/alexsander-vieira/.local/lib/python3.8/site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/lib/python3/dist-packages (from python-dateutil>=2.8.1->pandas) (1.14.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-1.22.4 pandas-1.4.2 pytz-2022.1

##

### Series
A estrutura de representação tipo __Series__ do __Pandas__ é semelhante a um array unidimensional, porém os elementos podem ser indexados por números inteiros (como em um array do NumPy) ou por meio de rótulos (labels) que não precisam ser únicos e podem ser organizados de forma hierárquica.
- Quando os índices ou rótulos não são informados explicitamente, Pandas cria uma indexação com números inteiros automaticamente, variando os índices de $0$ (zero) a $n-1$, onde $n$ é o número de elementos na série.
- Os rótulos são usados para realizar buscas rápidas, alinhamento de dados e operações de junção de dados.

#### Criando séries com Pandas
Séries podem ser criadas no Pandas de diferentes formas, a partir de:
- Listas ou Arrays
- Dicionários
- DataFrames

### Utilizando Listas ou Arrays

In [ ]:
# Vamos criar uma Serie a partir de uma lista do Python


# Define a Serie


# Mostra o resultado para a Serie criada

Agora vamos criar uma Serie a partir de um __np.array__:

In [ ]:
# Vamos criar uma Serie a partir de uma lista do Python

# Cria um array usando a função np.array


# Cria a Serie a partir do array


# Mostra o resultado da Serie criada

### Utilizando Dicionários

In [ ]:
# Podemos criar Series a partir de Dicionarios tambem!

# Define o dicionario e seus elementos


# Cria a Serie a partir dee um dicionário


# Mostra o resultado da Serie criada

##

### Indexação

Assim como para os arrays, conseguimos acessar diversos elementos da __Serie__ a partir dos __índices:__

In [ ]:
# Plota o valor da serie na posição 3

In [ ]:
# Plota o valor da serie na posição 7

In [ ]:
# Cria um loop onde varre todos os elementos da Serie entre 0 e 8

Da mesma forma, conseguimos fazer o __Slicing__ em uma __Serie__:

In [ ]:
# Fatia a Serie até a posição 2

In [ ]:
# Fatia a Serie a partir da posição 4

##

### Labels

Uma característica especial das __Series__ é que podemos escolher quais os __índices__ que queremos atribuir para cada um dos elementos e acessá-los a partir da __nova identifcação__ deles:

In [ ]:
# Cria uma lista com os nomes dos indices/labels


# Cria a lista de elementos da Serie


# Cria a Serie passando os elementos dela e os indices


# Plota o resultado para a Serie criada

In [ ]:
#series2['a'] ## valor unico

 ##lista de valores

In [ ]:
# Podemos igualmente acessar os nossos dados usando os novos indices
# trazer da Serie apenas os elementos que estão nos indices b e d

##

### Operações Matemáticas

De maneira análoga ao que fizemos usando os __arrays__, pode-se fazer qualquer tipo de manipulação matemática utilizando as __Series__:

In [ ]:
# Podemos fazer manipulações matemáticas utilizando as Series
# Adicionando o valor 10 para cada elemento da Serie

In [ ]:
# Dividindo cada elemento da Serie por 5

In [ ]:
# Divide o valor 300 por cada um dos elementos da Serie

##

## Métodos Pandas

Justamente pela biblioteca __Pandas__ utilizando do NumPy para a construção da sua arquitetura, muito dos métodos que são nativos do NumPy também vão funcionar com o __Pandas__, além de alguns novos métodos que veremos a seguir:

In [9]:
# Vamos agora criar uma série e armazenar notas de alunos da Let's Code

# Cria Serie com valores de notas para cada aluno
notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])

# Mostra o resultado da Serie criada
notas

0     10.0
1      8.0
2      6.5
3      9.0
4      7.5
5      8.5
6      9.0
7      9.0
8      4.0
9      8.5
10     7.5
11     8.0
12    10.0
13    10.0
14     4.5
15     4.5
16     9.0
17     8.0
18     8.0
19     9.0
20     9.0
21     9.0
22     6.5
23     5.0
24     6.0
25     4.5
26     9.0
27    10.0
28     1.0
29     0.0
30     5.0
31     7.0
32     9.0
33     6.5
34     5.0
35     8.0
dtype: float64

__sort_values__: este método ordena a Serie de acordo com os valores númericos dos elementos:

In [ ]:
# Ordenar as notas pelo valor delas:

#notas.sort_values(ascending=True, inplace=True) -> Se quiser editar direto na serie passo esse "inplace=True"

__unique:__ este método retorna todos os __valores distintos__ dentro de uma __Serie__:

__nunique:__ este método retorna a quantidade de __valores distintos__ dentro de uma __Serie__:

__value_counts:__ este método retorna as __frequências (contagens)__ para cada um dos __elementos distintos__ dentro de uma Serie:

Podemos também ao invés de retorna as frequências, retornar as __proporções__ de cada um dos __elementos distintos__:

A seguir teremos alguns outros métodos já conhecidos do __NumPy__ que retorna algumas estatísticas básicas para a Serie:

In [ ]:
# calcula a soma das notas

In [ ]:
# Retorna o maior valor da Serie

In [ ]:
# Retorna o menor valor da Serie

In [ ]:
# Calcula a media das notas da Serie

In [ ]:
# Calcula o Desvio padrão das notas

In [ ]:
# Calcula a mediana das notas das Series (termo central dos valores)

In [ ]:
# Calcula a moda das notas (a nota mais frequente)

__describe:__ este é um método muito útil que vai trazer um resumos das __principais estátisticas__ da Serie que estamops trabalhando:

##

## Exercícios

**1)** Cria uma série de pandas que tenha os números inteiros de 0 a 100.

In [14]:
a = pd.Series(np.arange(0, 101))
print(a)

0        0
1        1
2        2
3        3
4        4
      ...
96      96
97      97
98      98
99      99
100    100
Length: 101, dtype: int64

**2)** Considere uma série de notas de alunos:
 
 notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])
                   
Determine:

**a)** A nota média

**b)** O desvio padrão

**c)** A moda

**d)** A mediana

In [15]:
 notas = pd.Series([10, 8, 6.5, 9, 7.5, 8.5, 9, 9, 4, 8.5, 7.5,
                   8, 10, 10, 4.5, 4.5, 9, 8, 8, 9, 9, 9, 6.5,
                   5, 6, 4.5, 9, 10, 1, 0,5, 7, 9, 6.5, 5, 8])
                   
#a


#b


#c


#d
print(notas.mean())
print(notas.std())
print(notas.mode())
print(notas.median())

7.194444444444445
2.4327461783453628
0    9.0
dtype: float64
8.0

## DataFrame

__DataFrames__ assim como na mesma analogia para as matrizes, são um __conjunto de Series__ que vão ser bem caracterizados pelo o seu formato tabular (o que facilita muito o processo de manipulação dos dados!):

In [17]:
# Cria um dicionario com nomes de alunos e suas respectivas notas
dictionary = {'Alunos': ['Sandro', 'Rafael', 'Tiago', 'André', 'Camila', 'Teo', 'Carlos', 'Juca', 'Carla'],
              'Notas': [8, 10, 9.5, 7.5, 9.5, 10, 5, 6.5, 10]}

# Cria um DataFrame a partir de um dicionario
df = pd.DataFrame(dictionary)
print(df)
# Mostra o resultado do DataFrame

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

Todo o processo que vimos sobre __indexação__ e __métodos__  para as Series são válidas também quando trabalhamos com __DataFrames:__

In [20]:
# Retorna a coluna com os Nomes dos Alunos
print(df['Alunos'])

0    Sandro
1    Rafael
2     Tiago
3     André
4    Camila
5       Teo
6    Carlos
7      Juca
8     Carla
Name: Alunos, dtype: object

In [21]:
# Retorna a coluna com as notas dos Alunos
df['Notas']

0     8.0
1    10.0
2     9.5
3     7.5
4     9.5
5    10.0
6     5.0
7     6.5
8    10.0
Name: Notas, dtype: float64

In [22]:
print(df.index)

RangeIndex(start=0, stop=9, step=1)

In [23]:
## Filtro pelo indice
df.index == 1

array([False,  True, False, False, False, False, False, False, False])

In [ ]:
## Acessando com a máscara

In [ ]:
# Calcula a média das notas dos alunos

In [ ]:
# Retorna o nome do aluno localizado na posição 1

In [ ]:
## Linha de racionio
## 1 - Decide a mascara (filtro) Ex df['Alunos'] == 'Rafael'
## 2 - Acessei o dataframe na mascara Ex: df[mascara]
## 3 - Se eu quiser só uma coluna eu peço ela logo em seguida df[mascara][coluna]
df['Alunos'] ==

__Método loc:__ Este é um método especial para quando queremos acessar os elementos de um DataFrame, onde podemos acessar utilizando apenas os índices ou mesmo passando duas posições específicas:

In [24]:
# Retorna com o loc os elementos da posição 2
df.loc[1]

Alunos    Rafael
Notas       10.0
Name: 1, dtype: object

In [28]:
# Podemos usar o loc pra pegar um elemento em particular
# importante: a ordem é [linha, coluna]
df.loc[1, 'Notas'] = 10

In [29]:
df

   Alunos  Notas
0  Sandro    8.0
1  Rafael   10.0
2   Tiago    9.5
3   André    7.5
4  Camila    9.5
5     Teo   10.0
6  Carlos    5.0
7    Juca    6.5
8   Carla   10.0

## Máscaras Booleanas

Podemos fazer filtros no __DataFrame__ definindo como que para os arrays, as __máscaras booleanas:__

In [ ]:
# Chamando a coluna notas

In [ ]:
# Como o DataFrame é composto de varias Series, podemos utilizar-lo para fazer filtros
# Aplicando a mascara booleana a coluna notas

In [ ]:
# Retorna apenas os casos que satisfazem a condição

In [ ]:
# Outro exemplo de aplicação

## Exercícios

### Para o Dataframe de Alunos utilizado

**1)** Encontre a nota média dos alunos

In [30]:
df['Notas'].mean()

8.444444444444445

**2)** A nota do Juca

In [36]:
df[df['Alunos'] == 'Juca']['Notas']

7    6.5
Name: Notas, dtype: float64

**3)** Os alunos com nota menor que 6.5

In [38]:
df[df['Notas'] < 6.5]

   Alunos  Notas
6  Carlos    5.0

**4)** Peça a descrição das notas para ter insights interessantes

In [44]:
df.describe()

           Notas
count   9.000000
mean    8.444444
std     1.810463
min     5.000000
25%     7.500000
50%     9.500000
75%    10.000000
max    10.000000

**5)** A moda das notas acima de 7

In [47]:
df[df['Notas'] > 7]['Notas'].mode()

0    10.0
Name: Notas, dtype: float64

##

##

## Trabalhando com CSVs

O __Pandas__ tem algumas funcionalidades bem interessantes, como por exemplo permitir que carregue para o Notebook arquivos no formato csv, excel, xlsx e etc. Vamos ver uma aplicação como o CSV:

In [48]:
# Carrega um arquivo CSV
df = pd.read_csv('../Python/titanic.csv')

# Print do DataFrame
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

[Neste Link](https://www.kaggle.com/c/titanic/data), conseguimos mais informações sobre a base de dados do Titanic! O Kaggle é uma plataforma muito conheciida no quesito de competições de Data Science e Machine Learning, além de disponibilizar diversos conjuntos de dados para treinarmos =)

Vamos testar alguns outros __métodos__ disponíveis para os DaataFrames:

In [49]:
# Mostra as dimensões da DataFrame
df.shape

(891, 12)

__Método head/tail:__ São métodos muito importantes que mostram na tela as primeiras e últimas linhas respectivamente de um __DataFrame__:

In [53]:
df.head()
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [54]:
# Mostra as primeiras 10 linhas do DataFrame
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [55]:
# Mostra as ultimas 10 linhas do DataFrame
df.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [57]:
# Mostra a porcentagem de sobreviventes do Titanic
df['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [56]:
# Mostra a Contagem de Sobreviventes no Titanic
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

##

## Exercícios

### Para o Dataframe do Titanic

**1)** Faça a leitura do Dataframe e mostre as 5 primeiras linhas

In [59]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**2)** Calcule a tarifa média por Sexo

In [69]:
df[df['Sex'] == 'female']['Fare'].mean()

44.47981783439491

In [70]:

df[df['Sex'] == 'male']['Fare'].mean()

25.523893414211443

**3)** Determine o passageiro que pagou a maior tarifa

In [64]:
df[df['Fare'] == df['Fare'].max()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

**4)** Determine a idade média dos sobreviventes

In [65]:
df[df['Survived'] == 1]['Age'].mean()

28.343689655172415

In [75]:
df[df['Survived'] == 1]['Pclass'].value_counts(normalize=True)

1    0.397661
3    0.347953
2    0.254386
Name: Pclass, dtype: float64

## Desafio

1 - Escolha um dataset do [Kaggle](https://www.kaggle.com/), explore seus dados e traga uma informação interessante que você encontrou. Esta prática é bastante importante para familizariação com a exploração de dataframes

## Links, Artigos e Referências:

- [Documentação do Pandas](https://pandas.pydata.org/docs/), documentação onde vocês podem encontrar mais informações sobre os métodos e funções do Pandas e descobrir novos métodos que não foram apresentados no curso;
- ["10 Python Pandas Tricks that make your work more efficient",](https://towardsdatascience.com/10-python-pandas-tricks-that-make-your-work-more-efficient-2e8e483808ba) artigo escrito pelo Towards Data Science;
- ["28 useful Pandas functions you might not know"](https://paulovasconcellos.com.br/28-useful-pandas-functions-you-might-not-know-de42c59db085https://medium.com/@zachary.bedell/writing-beautiful-code-with-numpy-505f3b353174), artigo escrito por Paulo Vasconcellos para o Data Hackers;